#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ВариантОтчета	= "Заказы_Номенклатура";
	ИсточникЗаказов = "Все";

	Об = РеквизитФормыВЗначение("Отчет");
	
	СКД = Об.ПолучитьМакет("Отбор_Заказы");
	
	АдресСхемы = ПоместитьВоВременноеХранилище(СКД, Новый УникальныйИдентификатор());
	
	ОтборЗаказы.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы));
	
	НастройкиПоУмолчанию = СКД.НастройкиПоУмолчанию;
	
	ОтборЗаказы.ЗагрузитьНастройки(НастройкиПоУмолчанию);
	
	Если НЕ РольДоступна("ПолныеПрава")
		И НЕ QWERTY_Привилегированный.ПрофильДоступен(Справочники.ПрофилиГруппДоступа.Бухгалтер)
		Тогда
		Элементы.СтраницаЗарплатаПоМенеджерам.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПереключитьВидимостьСтраниц();
КонецПроцедуры

&НаКлиенте
Процедура ВариантОтчетаПриИзменении(Элемент)
	ПереключитьВидимостьСтраниц();
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет(Команда)

	ПереключитьВидимостьСтраниц();
	
	РасшифровкаЗаказ = "";
	
	Если ВариантОтчета = "Заказы_Номенклатура" Тогда
		Результат = СформироватьОтчетНаСервереЗаказыНоменклатура();
		СформироватьОтчетЗарплатаПоМенеджерам();
	ИначеЕсли ВариантОтчета = "Номенклатура_Заказы" Тогда
		СформироватьОтчетНаСервереНоменклатураЗаказы();
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(ЭтаФорма.Элементы.Результат, "НЕИСПОЛЬЗОВАТЬ");
	
КонецПроцедуры

#КонецОбласти

#Область СобратьДанные

Функция ПолучитьЗначениеДопРеквизитаСкладской(п_Заказ)
	
	Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Складской (Список заказов клиентов)");
	
	Рез = УправлениеСвойствами.ЗначениеСвойства(п_Заказ, Свойство);
	
	Возврат Рез;

КонецФункции // ()

Функция ЕстьРасходПрошлыхПериодов(п_Заказ, п_ДатаНачала)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриобретениеУслугПрочихАктивовРасходы.Ссылка.Дата КАК Дата,
		|	ПриобретениеУслугПрочихАктивовРасходы.Ссылка КАК Ссылка,
		|	ПриобретениеУслугПрочихАктивовРасходы.АналитикаРасходов КАК АналитикаРасходов,
		|	ПриобретениеУслугПрочихАктивовРасходы.СтатьяРасходов КАК СтатьяРасходов,
		|	ПриобретениеУслугПрочихАктивовРасходы.СуммаСНДС КАК СуммаСНДС
		|ИЗ
		|	Документ.ПриобретениеУслугПрочихАктивов.Расходы КАК ПриобретениеУслугПрочихАктивовРасходы
		|ГДЕ
		|	ПриобретениеУслугПрочихАктивовРасходы.АналитикаРасходов = &АналитикаРасходов
		|	И ПриобретениеУслугПрочихАктивовРасходы.Ссылка.Дата < &ДатаНачала
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	РасходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Дата,
		|	РасходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка,
		|	РасходныйКассовыйОрдерРасшифровкаПлатежа.АналитикаРасходов,
		|	РасходныйКассовыйОрдерРасшифровкаПлатежа.СтатьяРасходов,
		|	РасходныйКассовыйОрдерРасшифровкаПлатежа.Сумма
		|ИЗ
		|	Документ.РасходныйКассовыйОрдер.РасшифровкаПлатежа КАК РасходныйКассовыйОрдерРасшифровкаПлатежа
		|ГДЕ
		|	РасходныйКассовыйОрдерРасшифровкаПлатежа.АналитикаРасходов = &АналитикаРасходов
		|	И РасходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Дата < &ДатаНачала";
	
	Запрос.УстановитьПараметр("АналитикаРасходов", п_Заказ);
	Запрос.УстановитьПараметр("ДатаНачала", п_ДатаНачала);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Возврат Выборка.Количество() > 0;
	
КонецФункции // ()

Функция НоменклатураЕстьВДокументе(п_Заказ, п_Номенклатура)
	
	Если НЕ ЗначениеЗаполнено(п_Заказ) Тогда
		Возврат Ложь;
	КонецЕсли;

	Для каждого Т Из п_Заказ.Товары Цикл
		Если п_Номенклатура.ЭтоГруппа Тогда
			Если Т.Номенклатура.ПринадлежитЭлементу(п_Номенклатура) Тогда
				Возврат Истина;
			КонецЕсли;
		Иначе
			Если Т.Номенклатура = п_Номенклатура Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Возврат Ложь;
КонецФункции // ()

Функция ПолучитьСуммуКорректировки(п_Заказ, п_Номенклатура)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КорректировкаРеализацииТовары.НомерСтроки КАК НомерСтроки,
	               |	КорректировкаРеализацииТовары.Номенклатура КАК Номенклатура,
	               |	КорректировкаРеализацииТовары.Сумма КАК Сумма,
	               |	КорректировкаРеализацииТовары.Количество КАК Количество
	               |ИЗ
	               |	Документ.КорректировкаРеализации.Товары КАК КорректировкаРеализацииТовары
	               |ГДЕ
	               |	КорректировкаРеализацииТовары.ЗаказКлиента = &ЗаказКлиента
	               |	И КорректировкаРеализацииТовары.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("ЗаказКлиента", п_Заказ);
	Запрос.УстановитьПараметр("Номенклатура", п_Номенклатура);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Сумма;
	КонецЕсли;		
	
	Возврат 0;
	
КонецФункции

Функция ПолучитьДокументРеализации(п_Заказ)
	
	СписокСущДокРеал = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.ПометкаУдаления = ЛОЖЬ
	|	И РеализацияТоваровУслуг.ЗаказКлиента = &ЗаказКлиента
	|
	|УПОРЯДОЧИТЬ ПО
	|	РеализацияТоваровУслуг.Дата";
	
	Запрос.УстановитьПараметр("ЗаказКлиента", п_Заказ);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;		
	
	Возврат "";
	
КонецФункции

Функция ПолучитьЗаказПоРеализации(п_Реализация)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	РеализацияТоваровУслугТовары.ЗаказКлиента КАК ЗаказКлиента
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	               |ГДЕ
	               |	РеализацияТоваровУслугТовары.Ссылка = &Ссылка
	               |	И РеализацияТоваровУслугТовары.Ссылка.Проведен";
	
	Запрос.УстановитьПараметр("Ссылка", п_Реализация);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ЗаказКлиента;
	КонецЕсли;		
	
	Возврат "";
	
КонецФункции

Функция ПолучитьТоварыЗаказов(п_Заказы)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
		|	ЗаказКлиентаТовары.Ссылка КАК Заказ
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|ГДЕ
		|	ЗаказКлиентаТовары.Ссылка В(&МассивЗаказов)
		|	И ЗаказКлиентаТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)";
	
	Запрос.УстановитьПараметр("МассивЗаказов", п_Заказы);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ()

Функция ПолучитьУчетнуюЦену(п_Номенклатура, п_ВидЦены, п_Дата)

	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|			&п_Дата,
		|			Номенклатура = &Номенклатура
		|				И ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних";
	
	Запрос.УстановитьПараметр("п_Дата", п_Дата);
	Запрос.УстановитьПараметр("ВидЦены", п_ВидЦены);
	Запрос.УстановитьПараметр("Номенклатура", п_Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Цена;
	КонецЕсли;
	
	Возврат 0;

КонецФункции // ()

Функция ПолучитьТЗ_ЭквайринговыеОперации(п_Заказы)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.ЭквайринговыйТерминал КАК Терминал,
		|	ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Заказ КАК Заказ,
		|	ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Заказ.КаналПродажи КАК КаналПродажи,
		|	ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка КАК Документ,
		|	СУММА(ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.СуммаДокумента) КАК Сумма
		|ПОМЕСТИТЬ ВТ_Документы
		|ИЗ
		|	Документ.ОперацияПоПлатежнойКарте.РасшифровкаПлатежа КАК ОперацияПоПлатежнойКартеРасшифровкаПлатежа
		|ГДЕ
		|	ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Заказ В(&Заказ)
		|
		|СГРУППИРОВАТЬ ПО
		|	ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.ЭквайринговыйТерминал,
		|	ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Заказ,
		|	ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Заказ.КаналПродажи,
		|	ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КаналыПродаж.Ссылка КАК КаналПродажи,
		|	ВЫРАЗИТЬ(КаналыПродаж.Налог КАК ЧИСЛО(10, 2)) КАК Процент
		|ПОМЕСТИТЬ ВТ_КаналыПродаж
		|ИЗ
		|	Справочник.КаналыПродаж КАК КаналыПродаж
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЭквайринговыеТерминалыДополнительныеРеквизиты.Ссылка КАК Терминал,
		|	ВЫРАЗИТЬ(ЭквайринговыеТерминалыДополнительныеРеквизиты.Значение КАК ЧИСЛО(10, 2)) КАК Процент
		|ПОМЕСТИТЬ ВТ_Терминалы
		|ИЗ
		|	Справочник.ЭквайринговыеТерминалы.ДополнительныеРеквизиты КАК ЭквайринговыеТерминалыДополнительныеРеквизиты
		|ГДЕ
		|	ЭквайринговыеТерминалыДополнительныеРеквизиты.Свойство = &Свойство
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Документы.Заказ КАК Заказ,
		|	ВТ_Документы.Сумма КАК Сумма,
		|	ВТ_Документы.Сумма * ЕСТЬNULL(ВТ_КаналыПродаж.Процент, 0) / 100 КАК УСН,
		|	ВТ_Документы.Сумма * ЕСТЬNULL(ВТ_Терминалы.Процент, 0) / 100 КАК Комиссия,
		|	ЕСТЬNULL(ВТ_Терминалы.Процент, 0) КАК Процент,
		|	ЗаказКлиентаДополнительныеРеквизиты.Значение КАК КодПлатежнойСистемы,
		|	ВТ_Документы.Заказ.КаналПродажи КАК КаналПродажи
		|ИЗ
		|	ВТ_Документы КАК ВТ_Документы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Терминалы КАК ВТ_Терминалы
		|		ПО ВТ_Документы.Терминал = ВТ_Терминалы.Терминал
		
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КаналыПродаж КАК ВТ_КаналыПродаж
		|		ПО ВТ_Документы.КаналПродажи = ВТ_КаналыПродаж.КаналПродажи

		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.ДополнительныеРеквизиты КАК ЗаказКлиентаДополнительныеРеквизиты
		|		ПО ВТ_Документы.Заказ = ЗаказКлиентаДополнительныеРеквизиты.Ссылка
		|			И (ЗаказКлиентаДополнительныеРеквизиты.Свойство.Наименование = ""Код платежной системы (Список заказов клиентов)"")";
	
	Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Комиссия (Эквайринговые терминалы)");
	
	Запрос.УстановитьПараметр("Свойство", Свойство);
	Запрос.УстановитьПараметр("Заказ", п_Заказы);
	
	ТЗ_ЭквайринговыеОперации = Запрос.Выполнить().Выгрузить();
    ТЗ_ЭквайринговыеОперации.Индексы.Добавить("Заказ");
	
	Возврат ТЗ_ЭквайринговыеОперации;
	
КонецФункции // ()

Функция ПолучитьТЗ_СписаниеНедостачТоваров(п_ТЗ)
	
	Запрос = Новый Запрос;
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	СписаниеНедостачТоваровТовары.Ссылка.Подразделение КАК Подразделение,
		|	СписаниеНедостачТоваровТовары.Ссылка.АналитикаРасходов КАК Заказ,
		|	СписаниеНедостачТоваровТовары.Номенклатура КАК Номенклатура,
		|	СписаниеНедостачТоваровТовары.Количество КАК Количество,
		|	СписаниеНедостачТоваровТовары.Ссылка.АналитикаРасходов.КаналПродажи КАК КаналПродажи,
		|	СписаниеНедостачТоваровТовары.Ссылка.СтатьяРасходов КАК СтатьяРасходов,
		|	ЕСТЬNULL(СебестоимостьТоваровОбороты.СтоимостьРасход, 0) + ЕСТЬNULL(СебестоимостьТоваровОбороты.ДопРасходыРасход, 0) КАК Сумма
		|ИЗ
		|	Документ.СписаниеНедостачТоваров.Товары КАК СписаниеНедостачТоваровТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров.Обороты(, , Регистратор, ) КАК СебестоимостьТоваровОбороты
		|		ПО СписаниеНедостачТоваровТовары.Номенклатура = СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Номенклатура
		|			И СписаниеНедостачТоваровТовары.Ссылка = СебестоимостьТоваровОбороты.Регистратор
		|ГДЕ
		|	СписаниеНедостачТоваровТовары.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И СписаниеНедостачТоваровТовары.Ссылка.АналитикаРасходов ССЫЛКА Документ.ЗаказКлиента
		|	И СписаниеНедостачТоваровТовары.Ссылка.Подразделение = &Подразделение
		|	И СписаниеНедостачТоваровТовары.Ссылка.АналитикаРасходов.КаналПродажи = &КаналПродажи";
	
	
	Запрос.УстановитьПараметр("ДатаНачала", Отчет.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Отчет.ДатаОкончания));
	
	Если ЗначениеЗаполнено(Отчет.Подразделение) Тогда
		Запрос.УстановитьПараметр("Подразделение", Отчет.Подразделение);
	Иначе	
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И СписаниеНедостачТоваровТовары.Ссылка.Подразделение = &Подразделение", "");
	КонецЕсли;

	Если ЗначениеЗаполнено(Отчет.КаналПродажи) Тогда
		Запрос.УстановитьПараметр("КаналПродажи", Отчет.КаналПродажи);
	Иначе	
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И СписаниеНедостачТоваровТовары.Ссылка.АналитикаРасходов.КаналПродажи = &КаналПродажи", "");
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	ТЗ_СписаниеНедостачТоваров = Запрос.Выполнить().Выгрузить();
    ТЗ_СписаниеНедостачТоваров.Индексы.Добавить("Заказ");
	
	Возврат ТЗ_СписаниеНедостачТоваров;
	
КонецФункции // списание недостач товаров

// отмененные заказы
Процедура СобратьЗаказыОтмененные(п_ТЗ)

	Запрос = Новый Запрос;
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ЗаказКлиентаТовары.Ссылка.Подразделение КАК Подразделение,
		|	ЗаказКлиентаТовары.Ссылка КАК Заказ,
		|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
		|	ЗаказКлиентаТовары.Количество КАК Количество,
		|	0 КАК Выручка,
		|	ЕСТЬNULL(ЗаказКлиентаДополнительныеРеквизиты.Значение, ""Не заполнено"") КАК КодПлатежнойСистемы,
		|	ЗаказКлиентаТовары.Ссылка.КаналПродажи КАК КаналПродажи
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.ДополнительныеРеквизиты КАК ЗаказКлиентаДополнительныеРеквизиты
		|		ПО ЗаказКлиентаТовары.Ссылка = ЗаказКлиентаДополнительныеРеквизиты.Ссылка
		|			И (ЗаказКлиентаДополнительныеРеквизиты.Свойство.Наименование = ""Код платежной системы (Список заказов клиентов)"")
		|ГДЕ
		|	ЗаказКлиентаТовары.Ссылка.Проведен
		|	И ЗаказКлиентаТовары.Ссылка.КаналПродажи = &КаналПродажи
		|	И (ЗаказКлиентаТовары.Ссылка.СтатусЗаказаCRM = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказаCRM.Отменен)
		|			ИЛИ ЗаказКлиентаТовары.Ссылка.СтатусЗаказаCRM = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказаCRM.Отказ))
		|	И ЗаказКлиентаТовары.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ЗаказКлиентаТовары.Ссылка.Подразделение = &Подразделение";
	
	
	Запрос.УстановитьПараметр("НачалоПериода",	Отчет.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода",	КонецДня(Отчет.ДатаОкончания));
	
	Если ЗначениеЗаполнено(Отчет.Подразделение) Тогда
		Запрос.УстановитьПараметр("Подразделение", Отчет.Подразделение);
	Иначе	
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И ЗаказКлиентаТовары.Ссылка.Подразделение = &Подразделение", "");
	КонецЕсли;

	Если ЗначениеЗаполнено(Отчет.КаналПродажи) Тогда
		Запрос.УстановитьПараметр("КаналПродажи", Отчет.КаналПродажи);
	Иначе	
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И ЗаказКлиентаТовары.Ссылка.КаналПродажи = &КаналПродажи", "");
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;		
	
	ТЗ_Врем = Запрос.Выполнить().Выгрузить();
	
	Для каждого Т Из ТЗ_Врем Цикл

		НайденыСтроки = п_ТЗ.НайтиСтроки(Новый Структура("Заказ, Номенклатура", Т.Заказ, Т.Номенклатура));
		Если НайденыСтроки.Количество() > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = п_ТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Т);
		НоваяСтрока.Источник = "ОТ";
		//Сообщить("отмена: " + Т.Заказ);
	КонецЦикла;
	
КонецПроцедуры

// НЕ маркетплейсы
Процедура СобратьЗаказыИзРегистраПродажи(п_ТЗ)

	Запрос = Новый Запрос;
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ВыручкаИСебестоимостьПродажОбороты.Подразделение КАК Подразделение,
		|	ВыручкаИСебестоимостьПродажОбороты.ЗаказКлиента КАК Заказ,
		|	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
		|	ВыручкаИСебестоимостьПродажОбороты.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|	СУММА(ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиОборот) КАК Выручка,
		|	СУММА(ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот) КАК Количество,
		|	СУММА(ВыручкаИСебестоимостьПродажОбороты.СтоимостьОборот) + СУММА(ВыручкаИСебестоимостьПродажОбороты.ДопРасходыОборот) КАК Стоимость,
		|	ВыручкаИСебестоимостьПродажОбороты.ЗаказКлиента.КаналПродажи КАК КаналПродажи,
		|	NULL КАК Ссылка,
		|	ВЫБОР
		|		КОГДА ВыручкаИСебестоимостьПродажОбороты.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ТипРегистратора,
		|	ВЫБОР
		|		КОГДА ВыручкаИСебестоимостьПродажОбороты.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
		|			ТОГДА ВыручкаИСебестоимостьПродажОбороты.Регистратор.Дата
		|		ИНАЧЕ NULL
		|	КОНЕЦ КАК ДатаРеализации
		|ИЗ
		|	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетКомитенту)
		|				И Подразделение = &Подразделение) КАК ВыручкаИСебестоимостьПродажОбороты
		|ГДЕ
		|	ИСТИНА
		|	И ВыручкаИСебестоимостьПродажОбороты.ЗаказКлиента.КаналПродажи = &КаналПродажи
		|	И НЕ ВыручкаИСебестоимостьПродажОбороты.ЗаказКлиента.КаналПродажи.Маркетплейс
		|
		|СГРУППИРОВАТЬ ПО
		|	ВыручкаИСебестоимостьПродажОбороты.Подразделение,
		|	ВыручкаИСебестоимостьПродажОбороты.ЗаказКлиента,
		|	ВыручкаИСебестоимостьПродажОбороты.ХозяйственнаяОперация,
		|	ВыручкаИСебестоимостьПродажОбороты.ЗаказКлиента.КаналПродажи,
		|	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура,
		|	ВЫБОР
		|		КОГДА ВыручкаИСебестоимостьПродажОбороты.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|		КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВыручкаИСебестоимостьПродажОбороты.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
		|			ТОГДА ВыручкаИСебестоимостьПродажОбороты.Регистратор.Дата
		|		ИНАЧЕ NULL
		|	КОНЕЦ";
		
	Запрос.УстановитьПараметр("НачалоПериода",	Отчет.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода",	КонецДня(Отчет.ДатаОкончания));
	Запрос.УстановитьПараметр("ВидЦены",		Отчет.ВидУчетнойЦены);
	
	Если ЗначениеЗаполнено(Отчет.Подразделение) Тогда
		Запрос.УстановитьПараметр("Подразделение", Отчет.Подразделение);
	Иначе	
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И Подразделение = &Подразделение", "");
	КонецЕсли;

	Если ЗначениеЗаполнено(Отчет.КаналПродажи) Тогда
		Запрос.УстановитьПараметр("КаналПродажи", Отчет.КаналПродажи);
	Иначе	
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И ВыручкаИСебестоимостьПродажОбороты.ЗаказКлиента.КаналПродажи = &КаналПродажи", "");
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;		
	
	ТЗ_Врем = Запрос.Выполнить().Выгрузить();
	
	Для каждого Т Из ТЗ_Врем Цикл
		НоваяСтрока = п_ТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Т);
		НоваяСтрока.Источник = "Р";
	КонецЦикла;
	
КонецПроцедуры

// маркетплейсы
Процедура СобратьЗаказыИзПриобретениеУслуг(п_ТЗ)
	 
	 
#Область СборДанныхПоДокументам_ПриобретениеУслугПрочихАктивов
	
	Запрос = Новый Запрос;
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ВыручкаИСебестоимостьПродажОбороты.Подразделение КАК Подразделение,
		|	ВыручкаИСебестоимостьПродажОбороты.ЗаказКлиента КАК Заказ,
		|	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
		|	ВыручкаИСебестоимостьПродажОбороты.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|	СУММА(ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиОборот) КАК Выручка,
		|	СУММА(ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот) КАК Количество,
		|	СУММА(ВыручкаИСебестоимостьПродажОбороты.СтоимостьОборот) + СУММА(ВыручкаИСебестоимостьПродажОбороты.ДопРасходыОборот) КАК Стоимость,
		|	ВыручкаИСебестоимостьПродажОбороты.Период КАК Период,
		|	ВЫБОР
		|		КОГДА ВыручкаИСебестоимостьПродажОбороты.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
		|			ТОГДА 1
		|		КОГДА ВыручкаИСебестоимостьПродажОбороты.Регистратор ССЫЛКА Документ.КорректировкаРеализации
		|			ТОГДА 2
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ТипРегистратора
		|ПОМЕСТИТЬ ВТ_Продажи
		|ИЗ
		|	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(
		|			,
		|			,
		|			Регистратор,
		|			ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетКомитенту)
		|				И заказКлиента В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВЫРАЗИТЬ(ПриобретениеУслугПрочихАктивовРасходы.АналитикаРасходов КАК Документ.ЗаказКлиента) КАК Заказ
		|					ИЗ
		|						Документ.ПриобретениеУслугПрочихАктивов.Расходы КАК ПриобретениеУслугПрочихАктивовРасходы
		|					ГДЕ
		|						ПриобретениеУслугПрочихАктивовРасходы.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|						И НЕ ВЫРАЗИТЬ(ПриобретениеУслугПрочихАктивовРасходы.АналитикаРасходов КАК Документ.ЗаказКлиента) ЕСТЬ NULL
		|					СГРУППИРОВАТЬ ПО
		|						ПриобретениеУслугПрочихАктивовРасходы.СтатьяРасходов,
		|						ВЫРАЗИТЬ(ПриобретениеУслугПрочихАктивовРасходы.АналитикаРасходов КАК Документ.ЗаказКлиента))) КАК ВыручкаИСебестоимостьПродажОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	ВыручкаИСебестоимостьПродажОбороты.Подразделение,
		|	ВыручкаИСебестоимостьПродажОбороты.ЗаказКлиента,
		|	ВыручкаИСебестоимостьПродажОбороты.ХозяйственнаяОперация,
		|	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура,
		|	ВыручкаИСебестоимостьПродажОбороты.Период,
		|	ВЫБОР
		|		КОГДА ВыручкаИСебестоимостьПродажОбороты.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
		|			ТОГДА 1
		|		КОГДА ВыручкаИСебестоимостьПродажОбороты.Регистратор ССЫЛКА Документ.КорректировкаРеализации
		|			ТОГДА 2
		|		ИНАЧЕ 0
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Продажи.Подразделение КАК Подразделение,
		|	ВТ_Продажи.Заказ КАК Заказ,
		|	ВТ_Продажи.Номенклатура КАК Номенклатура,
		|	ВТ_Продажи.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|	ВТ_Продажи.Выручка КАК Выручка,
		|	ВТ_Продажи.Количество КАК Количество,
		|	ВТ_Продажи.Стоимость КАК Стоимость,
		|	ВТ_Продажи.Заказ.КаналПродажи КАК КаналПродажи,
		|	ВТ_Продажи.Период КАК Период,
		|	ВТ_Продажи.ТипРегистратора КАК ТипРегистратора
		|ИЗ
		|	ВТ_Продажи КАК ВТ_Продажи
		|ГДЕ
		|	ВТ_Продажи.Период <= &ДатаОкончания
		|	И ВТ_Продажи.Заказ.КаналПродажи = &КаналПродажи
		|	И ВТ_Продажи.Подразделение = &Подразделение
		|	И ВТ_Продажи.Заказ.КаналПродажи.Маркетплейс
		|	И ВТ_Продажи.Заказ.СтатусЗаказаCRM <> ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказаCRM.Отменен)";
	
	Запрос.УстановитьПараметр("ДатаНачала", Отчет.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Отчет.ДатаОкончания));
	
	Если ЗначениеЗаполнено(Отчет.Подразделение) Тогда
		Запрос.УстановитьПараметр("Подразделение", Отчет.Подразделение);
	Иначе	
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И ВТ_Продажи.Подразделение = &Подразделение", "");
	КонецЕсли;

	Если ЗначениеЗаполнено(Отчет.КаналПродажи) Тогда
		Запрос.УстановитьПараметр("КаналПродажи", Отчет.КаналПродажи);
	Иначе	
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И ВТ_Продажи.Заказ.КаналПродажи = &КаналПродажи", "");
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	РезультатЗапроса = Запрос.Выполнить();

	ТестТЗ = РезультатЗапроса.Выгрузить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = п_ТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.Источник = "МП";
	КонецЦикла;

#КонецОбласти	

#Область СборДанныхПоДокументам_РасходныйКассовыйОрдер
	
	Запрос = Новый Запрос;
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ВыручкаИСебестоимостьПродажОбороты.Подразделение КАК Подразделение,
		|	ВыручкаИСебестоимостьПродажОбороты.ЗаказКлиента КАК Заказ,
		|	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
		|	ВыручкаИСебестоимостьПродажОбороты.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|	СУММА(ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиОборот) КАК Выручка,
		|	СУММА(ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот) КАК Количество,
		|	СУММА(ВыручкаИСебестоимостьПродажОбороты.СтоимостьОборот) + СУММА(ВыручкаИСебестоимостьПродажОбороты.ДопРасходыОборот) КАК Стоимость,
		|	ВыручкаИСебестоимостьПродажОбороты.Период КАК Период,
		|	ВЫБОР
		|		КОГДА ВыручкаИСебестоимостьПродажОбороты.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
		|			ТОГДА 1
		|		КОГДА ВыручкаИСебестоимостьПродажОбороты.Регистратор ССЫЛКА Документ.КорректировкаРеализации
		|			ТОГДА 2
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ТипРегистратора
		|ПОМЕСТИТЬ ВТ_Продажи
		|ИЗ
		|	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(
		|			,
		|			,
		|			Регистратор,
		|			ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетКомитенту)
		|				И заказКлиента В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВЫРАЗИТЬ(РасходныйКассовыйОрдерРасшифровкаПлатежа.АналитикаРасходов КАК Документ.ЗаказКлиента) КАК Заказ
		|					ИЗ
		|						Документ.РасходныйКассовыйОрдер.РасшифровкаПлатежа КАК РасходныйКассовыйОрдерРасшифровкаПлатежа
		|					ГДЕ
		|						РасходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|						И НЕ ВЫРАЗИТЬ(РасходныйКассовыйОрдерРасшифровкаПлатежа.АналитикаРасходов КАК Документ.ЗаказКлиента) ЕСТЬ NULL
		|					СГРУППИРОВАТЬ ПО
		|						РасходныйКассовыйОрдерРасшифровкаПлатежа.СтатьяРасходов,
		|						ВЫРАЗИТЬ(РасходныйКассовыйОрдерРасшифровкаПлатежа.АналитикаРасходов КАК Документ.ЗаказКлиента))) КАК ВыручкаИСебестоимостьПродажОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	ВыручкаИСебестоимостьПродажОбороты.Подразделение,
		|	ВыручкаИСебестоимостьПродажОбороты.ЗаказКлиента,
		|	ВыручкаИСебестоимостьПродажОбороты.ХозяйственнаяОперация,
		|	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура,
		|	ВыручкаИСебестоимостьПродажОбороты.Период,
		|	ВЫБОР
		|		КОГДА ВыручкаИСебестоимостьПродажОбороты.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
		|			ТОГДА 1
		|		КОГДА ВыручкаИСебестоимостьПродажОбороты.Регистратор ССЫЛКА Документ.КорректировкаРеализации
		|			ТОГДА 2
		|		ИНАЧЕ 0
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Продажи.Подразделение КАК Подразделение,
		|	ВТ_Продажи.Заказ КАК Заказ,
		|	ВТ_Продажи.Номенклатура КАК Номенклатура,
		|	ВТ_Продажи.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|	ВТ_Продажи.Выручка КАК Выручка,
		|	ВТ_Продажи.Количество КАК Количество,
		|	ВТ_Продажи.Стоимость КАК Стоимость,
		|	ВТ_Продажи.Заказ.КаналПродажи КАК КаналПродажи,
		|	ВТ_Продажи.Период КАК Период,
		|	ВТ_Продажи.ТипРегистратора КАК ТипРегистратора
		|ИЗ
		|	ВТ_Продажи КАК ВТ_Продажи
		|ГДЕ
		|	ВТ_Продажи.Период <= &ДатаОкончания
		|	И ВТ_Продажи.Заказ.КаналПродажи = &КаналПродажи
		|	И ВТ_Продажи.Подразделение = &Подразделение
		|	И ВТ_Продажи.Заказ.КаналПродажи.Маркетплейс
		|	И ВТ_Продажи.Заказ.СтатусЗаказаCRM <> ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказаCRM.Отменен)";
	
	Запрос.УстановитьПараметр("ДатаНачала", Отчет.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Отчет.ДатаОкончания));
	
	Если ЗначениеЗаполнено(Отчет.Подразделение) Тогда
		Запрос.УстановитьПараметр("Подразделение", Отчет.Подразделение);
	Иначе	
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И ВТ_Продажи.Подразделение = &Подразделение", "");
	КонецЕсли;

	Если ЗначениеЗаполнено(Отчет.КаналПродажи) Тогда
		Запрос.УстановитьПараметр("КаналПродажи", Отчет.КаналПродажи);
	Иначе	
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И ВТ_Продажи.Заказ.КаналПродажи = &КаналПродажи", "");
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	РезультатЗапроса = Запрос.Выполнить();

	ТестТЗ = РезультатЗапроса.Выгрузить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл

		НайденыСтроки = п_ТЗ.НайтиСтроки(Новый Структура("Заказ, Номенклатура", Выборка.Заказ, Выборка.Номенклатура));
		Если НайденыСтроки.Количество() > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = п_ТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.Источник = "МП";
	КонецЦикла;

#КонецОбласти	
	

	// для учета корректрировки реализации, тип регистратора сбрасываем на -1	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ТипРегистратора = 2 Тогда
			НайденыСтроки = п_ТЗ.НайтиСтроки(Новый Структура("Заказ, Номенклатура, ТипРегистратора", Выборка.Заказ, Выборка.Номенклатура, 1));
			Для каждого Т Из НайденыСтроки Цикл
			    Т.Выручка = 0;
				Т.Стоимость = 0;
				Т.ТипРегистратора = -1;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;

	Для каждого Т Из п_ТЗ Цикл

		Если Т.ТипРегистратора = 2 Тогда
			Если НачалоМесяца(Т.Заказ.Дата) = НачалоМесяца(Т.Период) Тогда
				СуммаКорректировки = ПолучитьСуммуКорректировки(Т.Заказ, Т.Номенклатура);
			    Т.Выручка = СуммаКорректировки;
			КонецЕсли;	
		КонецЕсли;
		
		//Если ЕстьРасходПрошлыхПериодов(Т.Заказ, Отчет.ДатаНачала) Тогда
		//    Т.Выручка = СуммаКорректировки;
		//КонецЕсли;		
		
	КонецЦикла;
	
 КонецПроцедуры

 // Возвраты
Процедура СобратьЗаказыВозвраты(п_ТЗ)
	 
	Запрос = Новый Запрос;
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ВыручкаИСебестоимостьПродажОбороты.Подразделение КАК Подразделение,
		|	ВыручкаИСебестоимостьПродажОбороты.ЗаказКлиента КАК Заказ,
		|	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
		|	ВыручкаИСебестоимостьПродажОбороты.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|	СУММА(ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиОборот) КАК Выручка,
		|	СУММА(ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот) КАК Количество,
		|	СУММА(ВыручкаИСебестоимостьПродажОбороты.СтоимостьОборот) + СУММА(ВыручкаИСебестоимостьПродажОбороты.ДопРасходыОборот) КАК Стоимость
		|ПОМЕСТИТЬ ВТ_Продажи
		|ИЗ
		|	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(
		|			,
		|			,
		|			День,
		|			ЗаказКлиента В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВЫРАЗИТЬ(ВозвратТоваровОтКлиента.ДокументРеализации.ЗаказКлиента КАК Документ.ЗаказКлиента) КАК ЗаказКлиента
		|					ИЗ
		|						Документ.ВозвратТоваровОтКлиента КАК ВозвратТоваровОтКлиента
		|					ГДЕ
		|						ВозвратТоваровОтКлиента.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
		|				И (ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровОтКлиентаПрошлыхПериодов)
		|					ИЛИ ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноРеализации))) КАК ВыручкаИСебестоимостьПродажОбороты
		|ГДЕ
		|	ВыручкаИСебестоимостьПродажОбороты.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		|
		|СГРУППИРОВАТЬ ПО
		|	ВыручкаИСебестоимостьПродажОбороты.Подразделение,
		|	ВыручкаИСебестоимостьПродажОбороты.ЗаказКлиента,
		|	ВыручкаИСебестоимостьПродажОбороты.ХозяйственнаяОперация,
		|	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Продажи.Подразделение КАК Подразделение,
		|	ВТ_Продажи.Заказ КАК Заказ,
		|	ВТ_Продажи.Номенклатура КАК Номенклатура,
		|	ВТ_Продажи.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|	ВТ_Продажи.Выручка КАК Выручка,
		|	ВТ_Продажи.Количество КАК Количество,
		|	ВТ_Продажи.Стоимость КАК Стоимость,
		|	ЕСТЬNULL(ЗаказКлиентаДополнительныеРеквизиты.Значение, ""Не заполнено"") КАК КодПлатежнойСистемы,
		|	ВТ_Продажи.Заказ.КаналПродажи КАК КаналПродажи
		|ИЗ
		|	ВТ_Продажи КАК ВТ_Продажи
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.ДополнительныеРеквизиты КАК ЗаказКлиентаДополнительныеРеквизиты
		|		ПО ВТ_Продажи.Заказ = ЗаказКлиентаДополнительныеРеквизиты.Ссылка
		|			И (ЗаказКлиентаДополнительныеРеквизиты.Свойство.Наименование = ""Код платежной системы (Список заказов клиентов)"")
		|ГДЕ
		|	ИСТИНА
		|	И ВТ_Продажи.Подразделение = &Подразделение
		|	И ВТ_Продажи.Заказ.КаналПродажи = &КаналПродажи";
	
	Запрос.УстановитьПараметр("ДатаНачала", Отчет.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Отчет.ДатаОкончания));
	
	Если ЗначениеЗаполнено(Отчет.Подразделение) Тогда
		Запрос.УстановитьПараметр("Подразделение", Отчет.Подразделение);
	Иначе	
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И ВТ_Продажи.Подразделение = &Подразделение", "");
	КонецЕсли;

	Если ЗначениеЗаполнено(Отчет.КаналПродажи) Тогда
		Запрос.УстановитьПараметр("КаналПродажи", Отчет.КаналПродажи);
	Иначе	
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И ВТ_Продажи.Заказ.КаналПродажи = &КаналПродажи", "");
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	ТЗ_Врем = Запрос.Выполнить().Выгрузить();
	ТЗ_Поиск = п_ТЗ;
	ТЗ_Поиск.Индексы.Добавить("Заказ, Номенклатура");

	ЛогСообщить(" - начало цикла обр-ки возвратов -");
	Для каждого Т Из ТЗ_Врем Цикл
		
		ЛогСообщить("хоз. операция: " + Т.ХозяйственнаяОперация);
		
		НайденыСтроки = ТЗ_Поиск.НайтиСтроки(Новый Структура("Заказ, Номенклатура, Источник", Т.Заказ, Т.Номенклатура, "Р"));
		Если НайденыСтроки.Количество() > 0 Тогда
			Для каждого НайденаСтрока Из НайденыСтроки Цикл
				НайденаСтрока.Источник = "ВПП"; // возврат прошлого периода
				ЛогСообщить("   - Пометка ВПП: " + Т.Заказ);
			КонецЦикла;
			ЛогСообщить("   - Пропустили строку возврата (Р): " + Т.Заказ);
			Продолжить;
		КонецЕсли;

		НайденыСтроки = ТЗ_Поиск.НайтиСтроки(Новый Структура("Заказ, Номенклатура, Источник", Т.Заказ, Т.Номенклатура, "МП"));
		Если НайденыСтроки.Количество() > 0 Тогда
			Если Т.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СторноРеализации Тогда
				ЛогСообщить("   - Пропустили строку возврата (МП): " + Т.Заказ);
				Продолжить;
			ИначеЕсли Т.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратТоваровОтКлиентаПрошлыхПериодов Тогда
				Для каждого НайденаСтрока Из НайденыСтроки Цикл
					НайденаСтрока.Выручка = 0;
					НайденаСтрока.Стоимость = 0;
					НайденаСтрока.Количество = 0;
					НайденаСтрока.Источник = "ВПП";
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		// строку возврата добавим только если для нее не нашлось пары с источником "Р" или "МП"
		НоваяСтрока = п_ТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Т);
		НоваяСтрока.Количество = НоваяСтрока.Количество;
		НоваяСтрока.Источник = "ВЗТ";
		
		ЛогСообщить("Добавили строку возврата: " + Т.Заказ);

	КонецЦикла;
	
 КонецПроцедуры
 
 // Заявки на возврат товаров от клиента
Процедура СобратьЗаявкиНаВозвратТоваровОтКлиента(п_ТЗ)
	 
	Запрос = Новый Запрос;
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ВыручкаИСебестоимостьПродажОбороты.Подразделение КАК Подразделение,
		|	ВыручкаИСебестоимостьПродажОбороты.ЗаказКлиента КАК Заявка,
		|	ВыручкаИСебестоимостьПродажОбороты.ЗаказКлиента.ДокументРеализации КАК Реализация,
		|	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
		|	СУММА(ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиОборот) КАК Выручка,
		|	СУММА(ВыручкаИСебестоимостьПродажОбороты.СтоимостьОборот) + СУММА(ВыручкаИСебестоимостьПродажОбороты.ДопРасходыОборот) КАК Стоимость,
		|	СУММА(ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот) КАК Количество
		|ИЗ
		|	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(&ДатаНачала, &ДатаОкончания, , ЗаказКлиента ССЫЛКА Документ.ЗаявкаНаВозвратТоваровОтКлиента) КАК ВыручкаИСебестоимостьПродажОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	ВыручкаИСебестоимостьПродажОбороты.Подразделение,
		|	ВыручкаИСебестоимостьПродажОбороты.ЗаказКлиента,
		|	ВыручкаИСебестоимостьПродажОбороты.ЗаказКлиента.ДокументРеализации,
		|	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура";
	
	Запрос.УстановитьПараметр("ДатаНачала", Отчет.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Отчет.ДатаОкончания));
	
	Запрос.Текст = ТекстЗапроса;
	
	ТЗ_Заявки = Запрос.Выполнить().Выгрузить();
	ТЗ_Заявки.Колонки.Добавить("Заказ", Новый ОписаниеТипов("ДокументСсылка.ЗаказКлиента"));
	
	Для каждого Т Из ТЗ_Заявки Цикл
		Т.Заказ = ПолучитьЗаказПоРеализации(Т.Реализация);
	КонецЦикла;

	ТЗ_Поиск = п_ТЗ.Скопировать();
	ТЗ_Поиск.Индексы.Добавить("Заказ, Номенклатура");

	ЛогСообщить(" - начало цикла обр-ки Заявка на возврат товаров от клиента -");
	Для каждого Т Из ТЗ_Заявки Цикл
		
		НайденыСтроки = ТЗ_Поиск.НайтиСтроки(Новый Структура("Заказ", Т.Заказ));
		Если НайденыСтроки.Количество() > 0 Тогда
			Для каждого НайденаСтрока Из НайденыСтроки Цикл
				Если ТипЗнч(НайденаСтрока.Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
					Если НайденаСтрока.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Товар Тогда
						Если НайденаСтрока.Количество <> 0 Тогда
							НоваяСтрока = п_ТЗ.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока, НайденаСтрока);
							НоваяСтрока.Источник		= "ЗВТ";
							НоваяСтрока.Заказ			= Т.Заказ;
							НоваяСтрока.Номенклатура	= Т.Номенклатура;
							НоваяСтрока.Выручка			= Т.Выручка;
							НоваяСтрока.Стоимость		= Т.Стоимость;
							НоваяСтрока.Количество		= Т.Количество;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
 КонецПроцедуры

Функция СобратьДанные(п_ВидОтчета)

	ТЗ = Новый ТаблицаЗначений; 
	
	ТЗ.Колонки.Добавить("Подразделение",		Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия"));
	ТЗ.Колонки.Добавить("КодПлатежнойСистемы",	Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(100)));
	ТЗ.Колонки.Добавить("КаналПродажи",			Новый ОписаниеТипов("СправочникСсылка.КаналыПродаж"));
	ТЗ.Колонки.Добавить("Заказ",				Новый ОписаниеТипов("ДокументСсылка.ЗаказКлиента"));
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.Номенклатура"));
	МассивТипов.Добавить(Тип("Строка")); 
	ТЗ.Колонки.Добавить("Номенклатура",			Новый ОписаниеТипов(МассивТипов,,Новый КвалификаторыСтроки(150)));

	ТЗ.Колонки.Добавить("Выручка",				Новый ОписаниеТипов("Число")); 
	ТЗ.Колонки.Добавить("Количество",			Новый ОписаниеТипов("Число")); 
	ТЗ.Колонки.Добавить("Цена",					Новый ОписаниеТипов("Число")); 
	ТЗ.Колонки.Добавить("Стоимость",			Новый ОписаниеТипов("Число")); 
	ТЗ.Колонки.Добавить("Прибыль",				Новый ОписаниеТипов("Число")); 
	ТЗ.Колонки.Добавить("Рентабельность",		Новый ОписаниеТипов("Число")); 
	ТЗ.Колонки.Добавить("Источник",				Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(10)));
	ТЗ.Колонки.Добавить("ОтборСтатьяРасходов",	Новый ОписаниеТипов("Булево")); 
	ТЗ.Колонки.Добавить("ТипРегистратора",		Новый ОписаниеТипов("Число")); 
	ТЗ.Колонки.Добавить("Период",				Новый ОписаниеТипов("Дата")); 
	ТЗ.Колонки.Добавить("ДатаРеализации",		Новый ОписаниеТипов("Дата")); 
	ТЗ.Колонки.Добавить("ДатаРасхода",			Новый ОписаниеТипов("Дата")); 

	ТЗ.Индексы.Добавить("Подразделение, КодПлатежнойСистемы, КаналПродажи, Заказ, Номенклатура");

	Если ИсточникЗаказов = "Все" Тогда
		СобратьЗаказыИзРегистраПродажи(ТЗ);
		СобратьЗаказыИзПриобретениеУслуг(ТЗ);
		СобратьЗаказыОтмененные(ТЗ);
		СобратьЗаказыВозвраты(ТЗ);
		СобратьЗаявкиНаВозвратТоваровОтКлиента(ТЗ);

		//СобратьНедостачиТоваров(ТЗ);
	ИначеЕсли ИсточникЗаказов = "Реализация" Тогда
		СобратьЗаказыИзРегистраПродажи(ТЗ);
	ИначеЕсли ИсточникЗаказов = "ПриобретениеУслуг" Тогда
		СобратьЗаказыИзПриобретениеУслуг(ТЗ);
	ИначеЕсли ИсточникЗаказов = "Отмененные" Тогда
		СобратьЗаказыОтмененные(ТЗ);
	ИначеЕсли ИсточникЗаказов = "Возвраты" Тогда
		СобратьЗаказыВозвраты(ТЗ);
	Иначе
		Возврат "";
	КонецЕсли;

	Если ЗначениеЗаполнено(РасшифровкаЗаказ) Тогда
		ТЗ_Врем = ТЗ.Скопировать();
		ТЗ = ТЗ_Врем.Скопировать(Новый Массив);
		Для каждого Т Из ТЗ_Врем Цикл
			Если Т.Заказ = РасшифровкаЗаказ Тогда
				ЗаполнитьЗначенияСвойств(ТЗ.Добавить(), Т);
			КонецЕсли;
		КонецЦикла;
	Иначе
		Если ЗначениеЗаполнено(Отчет.Номенклатура) Тогда
			ТЗ_Врем = ТЗ.Скопировать();
			ТЗ = ТЗ_Врем.Скопировать(Новый Массив);
			Для каждого Т Из ТЗ_Врем Цикл
				Если НоменклатураЕстьВДокументе(Т.Заказ, Отчет.Номенклатура) Тогда
					ЗаполнитьЗначенияСвойств(ТЗ.Добавить(), Т);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;	

		Если Заказы.Количество() > 0 Тогда
			ТЗ_Врем = ТЗ.Скопировать();
			ТЗ = ТЗ_Врем.Скопировать(Новый Массив);
			Для каждого Т Из ТЗ_Врем Цикл
				НайденыСтроки = Заказы.НайтиСтроки(Новый Структура("ЗаказКлиента", Т.Заказ));
				Если НайденыСтроки.Количество() > 0 Тогда
					ЗаполнитьЗначенияСвойств(ТЗ.Добавить(), Т);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;	
	КонецЕсли;

	Если ОтборСобственныеАктивно Тогда
		ТЗ_Врем = ТЗ.Скопировать();
		ТЗ = ТЗ_Врем.Скопировать(Новый Массив);
		Для каждого Т Из ТЗ_Врем Цикл
			ЭтоСкладской = ПолучитьЗначениеДопРеквизитаСкладской(Т.Заказ);
			
			Если ЭтоСкладской = Неопределено Тогда
				Сообщить("Для заказа " + Т.Заказ + " не определено значение свойства Складской/Заказной");
			Иначе
				Если ОтборСобственные Тогда
					Если ЭтоСкладской Тогда
						ЗаполнитьЗначенияСвойств(ТЗ.Добавить(), Т);
					КонецЕсли;
				Иначе
					Если НЕ ЭтоСкладской Тогда
						ЗаполнитьЗначенияСвойств(ТЗ.Добавить(), Т);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
#Область СборРасходовПоДокументам

	мЗаказы = Новый Массив;
	Для каждого Т Из ТЗ Цикл
		Если Т.Количество <> 0 Тогда
			мЗаказы.Добавить(Т.Заказ);
		КонецЕсли;
	КонецЦикла;

	ТЗ_ЭквайринговыеОперации	= ПолучитьТЗ_ЭквайринговыеОперации(мЗаказы);
	ТЗ_СписаниеНедостачТоваров	= ПолучитьТЗ_СписаниеНедостачТоваров(ТЗ);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КаналыПродаж.Ссылка КАК КаналПродажи,
		|	ВЫРАЗИТЬ(КаналыПродаж.Налог КАК ЧИСЛО(10, 2)) КАК Процент
		|ПОМЕСТИТЬ ВТ_КаналыПродаж
		|ИЗ
		|	Справочник.КаналыПродаж КАК КаналыПродаж
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ДокументыРасхода.ВидДокумента КАК СТРОКА(50)) КАК ВидДокумента,
		|	ДокументыРасхода.Подразделение КАК Подразделение,
		|	ДокументыРасхода.Заказ КАК Заказ,
		|	ВЫРАЗИТЬ(ДокументыРасхода.Статья КАК СТРОКА(50)) КАК Статья,
		|	ДокументыРасхода.Сумма КАК Сумма,
		|	ДокументыРасхода.ДатаРасхода КАК ДатаРасхода,
		|	ДокументыРасхода.Заказ.КаналПродажи КАК КаналПродажи,
		|	NULL КАК КодПлатежнойСистемы
		|ИЗ
		|	(ВЫБРАТЬ
		|		""РКО"" КАК ВидДокумента,
		|		РасходныйКассовыйОрдерРасшифровкаПлатежа.Подразделение КАК Подразделение,
		|		РасходныйКассовыйОрдерРасшифровкаПлатежа.АналитикаРасходов КАК Заказ,
		|		РасходныйКассовыйОрдерРасшифровкаПлатежа.СтатьяРасходов.Наименование КАК Статья,
		|		СУММА(РасходныйКассовыйОрдерРасшифровкаПлатежа.Сумма) КАК Сумма,
		|		РасходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Дата КАК ДатаРасхода
		|	ИЗ
		|		Документ.РасходныйКассовыйОрдер.РасшифровкаПлатежа КАК РасходныйКассовыйОрдерРасшифровкаПлатежа
		|	ГДЕ
		|		РасходныйКассовыйОрдерРасшифровкаПлатежа.АналитикаРасходов ССЫЛКА Документ.ЗаказКлиента
		|		И РасходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Дата <= &ДатаОкончания
		|	
		|	СГРУППИРОВАТЬ ПО
		|		РасходныйКассовыйОрдерРасшифровкаПлатежа.Подразделение,
		|		РасходныйКассовыйОрдерРасшифровкаПлатежа.АналитикаРасходов,
		|		РасходныйКассовыйОрдерРасшифровкаПлатежа.СтатьяРасходов.Наименование,
		|		РасходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Дата
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		""Услуги"",
		|		ПриобретениеУслугПрочихАктивовРасходы.Подразделение,
		|		ПриобретениеУслугПрочихАктивовРасходы.АналитикаРасходов,
		|		ПриобретениеУслугПрочихАктивовРасходы.СтатьяРасходов.Наименование,
		|		СУММА(ПриобретениеУслугПрочихАктивовРасходы.СуммаСНДС),
		|		ПриобретениеУслугПрочихАктивовРасходы.Ссылка.Дата
		|	ИЗ
		|		Документ.ПриобретениеУслугПрочихАктивов.Расходы КАК ПриобретениеУслугПрочихАктивовРасходы
		|	ГДЕ
		|		ПриобретениеУслугПрочихАктивовРасходы.АналитикаРасходов ССЫЛКА Документ.ЗаказКлиента
		|		И ПриобретениеУслугПрочихАктивовРасходы.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|		И (ПриобретениеУслугПрочихАктивовРасходы.СтатьяРасходов = &СтатьяРасходов
		|					И (ВЫРАЗИТЬ(ПриобретениеУслугПрочихАктивовРасходы.АналитикаРасходов КАК Документ.ЗаказКлиента).Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
		|				ИЛИ ПриобретениеУслугПрочихАктивовРасходы.СтатьяРасходов <> &СтатьяРасходов)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ПриобретениеУслугПрочихАктивовРасходы.Подразделение,
		|		ПриобретениеУслугПрочихАктивовРасходы.АналитикаРасходов,
		|		ПриобретениеУслугПрочихАктивовРасходы.СтатьяРасходов.Наименование,
		|		ПриобретениеУслугПрочихАктивовРасходы.Ссылка.Дата
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		""Услуги"",
		|		СписаниеЗадолженностиЗадолженность.Ссылка.Подразделение,
		|		СписаниеЗадолженностиЗадолженность.Заказ,
		|		СписаниеЗадолженностиЗадолженность.Ссылка.СтатьяРасходов.Наименование,
		|		СУММА(СписаниеЗадолженностиЗадолженность.Сумма),
		|		СписаниеЗадолженностиЗадолженность.Ссылка.Дата
		|	ИЗ
		|		Документ.СписаниеЗадолженности.Задолженность КАК СписаниеЗадолженностиЗадолженность
		|	ГДЕ
		|		СписаниеЗадолженностиЗадолженность.Заказ ССЫЛКА Документ.ЗаказКлиента
		|		И СписаниеЗадолженностиЗадолженность.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	
		|	СГРУППИРОВАТЬ ПО
		|		СписаниеЗадолженностиЗадолженность.Ссылка.Подразделение,
		|		СписаниеЗадолженностиЗадолженность.Заказ,
		|		СписаниеЗадолженностиЗадолженность.Ссылка.СтатьяРасходов.Наименование,
		|		СписаниеЗадолженностиЗадолженность.Ссылка.Дата
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		""УСН"",
		|		Док.Подразделение,
		|		Док.Ссылка,
		|		""УСН"",
		|		МАКСИМУМ(Док.СуммаДокумента * ЕСТЬNULL(ВТ_КаналыПродаж.Процент, 0) / 100),
		|		Док.Дата
		|	ИЗ
		|		Документ.ЗаказКлиента КАК Док
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КаналыПродаж КАК ВТ_КаналыПродаж
		|			ПО Док.КаналПродажи = ВТ_КаналыПродаж.КаналПродажи
		|	
		|	СГРУППИРОВАТЬ ПО
		|		Док.Ссылка,
		|		Док.Подразделение,
		|		Док.Дата) КАК ДокументыРасхода
		|ГДЕ
		|	ДокументыРасхода.Заказ В(&Заказы)";

	Запрос.УстановитьПараметр("Заказы", 		мЗаказы);
	Запрос.УстановитьПараметр("СтатьяРасходов", ПланыВидовХарактеристик.СтатьиРасходов.НайтиПоНаименованию("Агентское вознаграждение", Истина));
	Запрос.УстановитьПараметр("ДатаНачала", 	Отчет.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",	КонецДня(Отчет.ДатаОкончания));

	ТЗ_Расходы = Запрос.Выполнить().Выгрузить();
	
	Для каждого Т Из ТЗ_ЭквайринговыеОперации Цикл

		НоваяСтрока = ТЗ_Расходы.Добавить();

		НоваяСтрока.Сумма				= Т.УСН;
		НоваяСтрока.Заказ				= Т.Заказ;
		НоваяСтрока.Статья				= "УСН";
		НоваяСтрока.Подразделение		= Т.Заказ.Подразделение;
		НоваяСтрока.ВидДокумента		= "УСН";
		НоваяСтрока.КодПлатежнойСистемы	= Т.КодПлатежнойСистемы;
		НоваяСтрока.КаналПродажи		= Т.КаналПродажи;
		НоваяСтрока.ДатаРасхода			= Т.Заказ.Дата;

		НоваяСтрока = ТЗ_Расходы.Добавить();

		НоваяСтрока.Сумма				= Т.Комиссия;
		НоваяСтрока.Заказ				= Т.Заказ;
		НоваяСтрока.Статья				= "Комиссия эквайринг";
		НоваяСтрока.Подразделение		= Т.Заказ.Подразделение;
		НоваяСтрока.ВидДокумента		= "Комиссия эквайринг";
		НоваяСтрока.КодПлатежнойСистемы	= Т.КодПлатежнойСистемы;
		НоваяСтрока.КаналПродажи		= Т.КаналПродажи;
		НоваяСтрока.ДатаРасхода			= Т.Заказ.Дата;
		
	КонецЦикла;

	Для каждого Т Из ТЗ_СписаниеНедостачТоваров Цикл

		НоваяСтрока = ТЗ_Расходы.Добавить();

		НоваяСтрока.Сумма				= Т.Сумма;
		НоваяСтрока.Заказ				= Т.Заказ;
		НоваяСтрока.Статья				= Т.СтатьяРасходов;
		НоваяСтрока.Подразделение		= Т.Заказ.Подразделение;
		НоваяСтрока.ВидДокумента		= "СНТ";
		НоваяСтрока.КаналПродажи		= Т.КаналПродажи;
		НоваяСтрока.ДатаРасхода			= Т.Заказ.Дата;

		//Сообщить("добавлено в расходы СНТ: " + Т.СтатьяРасходов + " " + Т.Сумма + " " + Т.Заказ);
	КонецЦикла;
	
	ТЗ_Расходы.Индексы.Добавить("Заказ, КодПлатежнойСистемы, КаналПродажи, Подразделение");

#КонецОбласти

#Область ОбработкаТаблиц

	ЛогСообщить("Точка1, ТЗ итог Кол-во: " + ТЗ.Итог("Количество"));
	ЛогСообщить("Точка1, ТЗ итог Выручка: " + ТЗ.Итог("Выручка"));

	ТЗ.Свернуть("Подразделение, КодПлатежнойСистемы, КаналПродажи, Заказ, Номенклатура, Источник, ОтборСтатьяРасходов, ТипРегистратора, Период, ДатаРеализации, ДатаРасхода", 
		"Выручка, Количество, Цена, Стоимость, Прибыль, Рентабельность");

	// получение цены товара
	Для каждого Т Из ТЗ Цикл
		Если Т.ТипРегистратора >= 0 Тогда
			ДокРеализации = ПолучитьДокументРеализации(Т.Заказ);
			Если ЗначениеЗаполнено(ДокРеализации) Тогда
				Т.Цена = ПолучитьУчетнуюЦену(Т.Номенклатура, Отчет.ВидУчетнойЦены, ДокРеализации.Дата);
			Иначе
				Т.Цена = ПолучитьУчетнуюЦену(Т.Номенклатура, Отчет.ВидУчетнойЦены, Т.Заказ.Дата);
			КонецЕсли;
		Иначе			
			Т.Цена = 0;
		КонецЕсли;
	КонецЦикла;
	
	ТЗ.Свернуть("Подразделение, КодПлатежнойСистемы, КаналПродажи, Заказ, Номенклатура, Источник, ОтборСтатьяРасходов, Период, ДатаРеализации, ДатаРасхода",
		 "Выручка, Количество, Цена, Стоимость, Прибыль, Рентабельность");
	
	Для каждого Т Из ТЗ Цикл
		
		// для заявок на возврат удалим УСН
		Если Т.Источник = "ЗВТ" Тогда
			НайденыСтроки = ТЗ_Расходы.НайтиСтроки(Новый Структура("Заказ, Статья", Т.Заказ, "УСН"));
			Для каждого СтрокаДляУдаления Из НайденыСтроки Цикл
				ТЗ_Расходы.Удалить(СтрокаДляУдаления);
			КонецЦикла;
		КонецЕсли;
		
		// для товаров расситываем прибыль и рентабельность
		Если ТипЗнч(Т.Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
			Если Т.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Товар Тогда
				Если Т.Выручка = 0 Тогда
					Т.Стоимость = 0;
					Т.Прибыль = 0;
					Т.Рентабельность = 0;

					НайденыСтроки = ТЗ_Расходы.НайтиСтроки(Новый Структура("Заказ, Статья", Т.Заказ, "УСН"));
					Для каждого СтрокаДляУдаления Из НайденыСтроки Цикл
						ТЗ_Расходы.Удалить(СтрокаДляУдаления);
					КонецЦикла;
				Иначе
					Если Т.Источник <> "ВЗТ" И Т.Источник <> "ЗВТ" Тогда
						Т.Стоимость = Т.Количество * Т.Цена;
						П = РассчитатьПоказатели(Т, ТЗ);
						ЗаполнитьЗначенияСвойств(Т, П);
					КонецЕсли;
					
					// для "старых" заказов удалим строки товаров 
					СтарыеЗаказыУдалить = Новый Массив;
					Если Т.Период < Отчет.ДатаНачала Тогда
						СтарыеЗаказыУдалить.Добавить(Т);
						НайденыСтроки = ТЗ_Расходы.НайтиСтроки(Новый Структура("Заказ, Статья", Т.Заказ, "УСН"));
						Для каждого СтрокаДляУдаления Из НайденыСтроки Цикл
							ТЗ_Расходы.Удалить(СтрокаДляУдаления);
						КонецЦикла;
					КонецЕсли;
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;
	
	Если СтарыеЗаказыУдалить <> Неопределено Тогда
		Для каждого Т Из СтарыеЗаказыУдалить Цикл
			ТЗ.Удалить(Т);
		КонецЦикла;
	КонецЕсли;
	
	Для каждого Т Из ТЗ_Расходы Цикл
		
		НайденыСтроки = ТЗ.НайтиСтроки(Новый Структура("Заказ", Т.Заказ));
		
		НоваяСтрока = ТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Т);
		НоваяСтрока.Номенклатура	= Т.Статья;
		НоваяСтрока.Стоимость		= Т.Сумма;
		НоваяСтрока.Выручка			= 0;
		НоваяСтрока.Количество		= 0;
		
		Если НайденыСтроки.Количество() > 0 Тогда
			НоваяСтрока.ДатаРеализации	= НайденыСтроки[0].ДатаРеализации;
			НоваяСтрока.Источник		= НайденыСтроки[0].Источник;
		КонецЕсли;
		
	КонецЦикла;

	// исключим лишние заказы, если установлен отбор по Статье расхода
	Если ЗначениеЗаполнено(ОтборСтатьяРасходов) Тогда

		Для каждого Т Из ТЗ Цикл
			Если ТипЗнч(ОтборСтатьяРасходов) = Тип("Строка") Тогда
				Если Т.Номенклатура = ОтборСтатьяРасходов Тогда
					Т.ОтборСтатьяРасходов = Истина;
				КонецЕсли;
			Иначе
				Если Строка(Т.Номенклатура) = ОтборСтатьяРасходов.Наименование Тогда
					Т.ОтборСтатьяРасходов = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		ТЗ_ЗаказыИсключить = ТЗ.Скопировать();
		ТЗ_ЗаказыИсключить.Свернуть("Заказ", "ОтборСтатьяРасходов");
		Для каждого Т Из ТЗ_ЗаказыИсключить Цикл
			Если Т.ОтборСтатьяРасходов Тогда
				Продолжить;
			КонецЕсли;
			СтрокиИсключить = ТЗ.НайтиСтроки(Новый Структура("Заказ", Т.Заказ));
			Для каждого СтрокаИсключить Из СтрокиИсключить Цикл
				ТЗ.Удалить(СтрокаИсключить);
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	// для теста, удали все заказы из ТЗ кроме заказа с номером 00ЦБ-009089
	ТЗ_Исключить = ТЗ.Скопировать();
	ТЗ_Исключить.Свернуть("Заказ", "Количество, Выручка");
	Для каждого Т Из ТЗ_Исключить Цикл
		Если Т.Заказ.Номер = "00ЦБ-009089" Тогда
			Продолжить;
		КонецЕсли;
		СтрокиИсключить = ТЗ.НайтиСтроки(Новый Структура("Заказ", Т.Заказ));
		Для каждого СтрокаИсключить Из СтрокиИсключить Цикл
			ТЗ.Удалить(СтрокаИсключить);
		КонецЦикла;
	КонецЦикла;

	// Удаляем строки с ДатаРасхода меньше ДатаНачала,
	// кроме строк с Источник = "Р", у которых ДатаРеализации в текущем периоде отчета
	ТЗ_Удалить = Новый Массив;
	Для каждого Т Из ТЗ Цикл
		Если ЗначениеЗаполнено(Т.ДатаРасхода) И Т.ДатаРасхода < Отчет.ДатаНачала Тогда
			Если Т.Источник = "Р"
				И Т.ДатаРеализации >= Отчет.ДатаНачала
				И Т.ДатаРеализации <= КонецДня(Отчет.ДатаОкончания) Тогда
				Продолжить;
			КонецЕсли;
			ТЗ_Удалить.Добавить(Т);
		КонецЕсли;
	КонецЦикла;
	Для каждого Т Из ТЗ_Удалить Цикл
		ТЗ.Удалить(Т);
	КонецЦикла;
	
	ЛогСообщить("Точка2, ТЗ итог Кол-во: " + ТЗ.Итог("Количество"));
	ЛогСообщить("Точка2, ТЗ итог Выручка: " + ТЗ.Итог("Выручка"));
	
#КонецОбласти

#Область ЗапросПолученияДерева
	Если п_ВидОтчета = "ЗаказыНоменклатура" Тогда

		Запрос = Новый Запрос;
		Запрос_Текст = 
			"ВЫБРАТЬ
			|	ТЗ.Подразделение КАК Подразделение,
			|	ТЗ.КодПлатежнойСистемы КАК КодПлатежнойСистемы,
			|	ТЗ.КаналПродажи КАК КаналПродажи,
			|	ТЗ.Заказ КАК Заказ,
			|	ТЗ.Номенклатура КАК Номенклатура,
			|	ТЗ.Выручка КАК Выручка,
			|	ТЗ.Количество КАК Количество,
			|	ТЗ.Стоимость КАК Стоимость,
			|	ТЗ.Прибыль КАК Прибыль,
			|	ТЗ.Рентабельность КАК Рентабельность,
			|	ТЗ.Источник КАК Источник,
			|	ТЗ.ДатаРеализации КАК ДатаРеализации,
			|	ТЗ.ДатаРасхода КАК ДатаРасхода
			|ПОМЕСТИТЬ ВТ_ТЗ
			|ИЗ
			|	&ТЗ КАК ТЗ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_ТЗ.Подразделение КАК Подразделение,
			|	ВТ_ТЗ.КодПлатежнойСистемы КАК КодПлатежнойСистемы,
			|	ВТ_ТЗ.КаналПродажи КАК КаналПродажи,
			|	ВТ_ТЗ.Заказ КАК Заказ,
			|	ВТ_ТЗ.Номенклатура КАК Номенклатура,
			|	ВТ_ТЗ.Выручка КАК Выручка,
			|	ВТ_ТЗ.Количество КАК Количество,
			|	ВТ_ТЗ.Стоимость КАК Стоимость,
			|	ВТ_ТЗ.Прибыль КАК Прибыль,
			|	ВТ_ТЗ.Рентабельность КАК Рентабельность,
			|	ВТ_ТЗ.Источник КАК Источник,
			|	ВТ_ТЗ.ДатаРеализации КАК ДатаРеализации,
			|	ВТ_ТЗ.ДатаРасхода КАК ДатаРасхода
			|ИЗ
			|	ВТ_ТЗ КАК ВТ_ТЗ
			|
			|УПОРЯДОЧИТЬ ПО
			|	КаналПродажи
			|ИТОГИ
			|	СУММА(Выручка),
			|	СУММА(Количество),
			|	СУММА(Стоимость),
			|	СУММА(Прибыль),
			|	МАКСИМУМ(Источник),
			|	МАКСИМУМ(ДатаРеализации),
			|	МАКСИМУМ(ДатаРасхода)
			|ПО
			|	ОБЩИЕ,
			|	Подразделение,
			|	КаналПродажи,
			|	Заказ,
			|	Номенклатура";
		
		Запрос.УстановитьПараметр("ТЗ", ТЗ);

		Запрос.Текст = Запрос_Текст;
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Рез =  Новый Структура();
		Рез.Вставить("Запрос1", РезультатЗапроса);

	ИначеЕсли п_ВидОтчета = "НоменклатураЗаказы" Тогда

		ТЗ_Врем = ТЗ.Скопировать();
		ТЗ_ДляДерева = ТЗ_Врем.Скопировать(Новый Массив);
		Для каждого Т Из ТЗ_Врем Цикл
			Если ТипЗнч(Т.Номенклатура) = Тип("Строка") Тогда
				 Продолжить;
			КонецЕсли;			
			Если Т.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Товар Тогда
				ЗаполнитьЗначенияСвойств(ТЗ_ДляДерева.Добавить(), Т);
			КонецЕсли;			
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос_Текст = 
			"ВЫБРАТЬ
			|	ТЗ.Подразделение КАК Подразделение,
			|	ТЗ.КаналПродажи КАК КаналПродажи,
			|	ТЗ.Заказ КАК Заказ,
			|	ТЗ.Номенклатура КАК Номенклатура,
			|	ТЗ.Источник КАК Источник,
			|	ТЗ.Выручка КАК Выручка,
			|	ТЗ.Стоимость КАК Стоимость,
			|	ТЗ.ДатаРеализации КАК ДатаРеализации,
			|	ТЗ.ДатаРасхода КАК ДатаРасхода
			|ПОМЕСТИТЬ ВТ_ТЗ
			|ИЗ
			|	&ТЗ КАК ТЗ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_ТЗ.Подразделение КАК Подразделение,
			|	ВТ_ТЗ.КаналПродажи КАК КаналПродажи,
			|	ВТ_ТЗ.Заказ КАК Заказ,
			|	ВТ_ТЗ.Номенклатура КАК Номенклатура,
			|	ВТ_ТЗ.Источник КАК Источник,
			|	ВТ_ТЗ.Выручка КАК Выручка,
			|	ВТ_ТЗ.Стоимость КАК Стоимость,
			|	ВТ_ТЗ.ДатаРеализации КАК ДатаРеализации,
			|	ВТ_ТЗ.ДатаРасхода КАК ДатаРасхода
			|ИЗ
			|	ВТ_ТЗ КАК ВТ_ТЗ
			|
			|УПОРЯДОЧИТЬ ПО
			|	КаналПродажи,
			|	Номенклатура,
			|	Заказ
			|ИТОГИ
			|	СУММА(Выручка),
			|	СУММА(Стоимость),
			|	МАКСИМУМ(Источник),
			|	МАКСИМУМ(ДатаРеализации),
			|	МАКСИМУМ(ДатаРасхода)
			|ПО
			|	Подразделение,
			|	КаналПродажи,
			|	Номенклатура,
			|	Заказ";
		
		Запрос.УстановитьПараметр("ТЗ", ТЗ_ДляДерева);

		Запрос.Текст = Запрос_Текст;
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Рез =  Новый Структура();
		Рез.Вставить("Запрос1", РезультатЗапроса);
		Рез.Вставить("ТЗ", ТЗ);
		
	КонецЕсли;
		
	Возврат Рез;
	
#КонецОбласти

КонецФункции // ()

#КонецОбласти

#Область Отчет_НоменклатураЗаказы

Функция РассчитатьПоказатели2(п_Выборка, п_ТЗ)
	
	Рез = Новый Структура("Выручка, Стоимость, Прибыль, Рентабельность, ДатаРеализации, ДатаРасхода");

	Если п_Выборка = Неопределено Тогда
		НайденыСтроки = п_ТЗ;
	//ИначеЕсли ТипЗнч(п_Выборка) = Тип("СтрокаТаблицыЗначений") Тогда
	//	НайденыСтроки = п_ТЗ.НайтиСтроки(Новый Структура("Номенклатура", п_Выборка.Номенклатура));
	Иначе
		НайденыСтроки = п_ТЗ.НайтиСтроки(Новый Структура(п_Выборка.Группировка(), п_Выборка[п_Выборка.Группировка()]));
	КонецЕсли;

	Выручка = 0;
	Стоимость = 0;
	Для каждого Т Из НайденыСтроки Цикл
		Выручка = Выручка + Т.Выручка;
		Стоимость = Стоимость + Т.Стоимость;
		Если Т.ДатаРеализации > Рез.ДатаРеализации Тогда
			Рез.ДатаРеализации = Т.ДатаРеализации;
		КонецЕсли;
		Если Т.ДатаРасхода > Рез.ДатаРасхода Тогда
			Рез.ДатаРасхода = Т.ДатаРасхода;
		КонецЕсли;
	КонецЦикла;
	
	Рез.Выручка		= Выручка;
	Рез.Стоимость	= Стоимость;
	Рез.Прибыль		= Выручка - Стоимость;

	Если Стоимость <> 0 Тогда
		Рез.Рентабельность	= Рез.Прибыль / Стоимость * 100;
	КонецЕсли;
	
	Возврат Рез;
	
КонецФункции // ()

Функция СформироватьОтчетНаСервереНоменклатураЗаказы()

	УстановитьПривилегированныйРежим(Истина);

	Об = РеквизитФормыВЗначение("Отчет");
	Макет = Об.ПолучитьМакет("МакетНоменклатураЗаказ");

	Струк_ДанныеЗапросов = СобратьДанные("НоменклатураЗаказы");
	РезультатЗапроса = Струк_ДанныеЗапросов.Запрос1;
	
	ОбЗаголовок		= Макет.ПолучитьОбласть("Заголовок");
	ОбШапка			= Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбПодр			= Макет.ПолучитьОбласть("Подразделение");
	ОбКанал			= Макет.ПолучитьОбласть("Канал");
	ОбНоменкл		= Макет.ПолучитьОбласть("Номенклатура");
	ОбЗаказ			= Макет.ПолучитьОбласть("Заказ");
	ОбИтого			= Макет.ПолучитьОбласть("ИТОГО");

	Результат.Очистить();
	
	ОбЗаголовок.Параметры.ПериодОтчета	= "с " + Формат(Отчет.ДатаНачала, "ДФ=dd.MM.yyyy")  + " по " + Формат(Отчет.ДатаОкончания, "ДФ=dd.MM.yyyy");
	ОбЗаголовок.Параметры.Подразделение	= Отчет.Подразделение;
	ОбЗаголовок.Параметры.КаналПродажи	= Отчет.КаналПродажи;
	ОбЗаголовок.Параметры.Номенклатура	= Отчет.Номенклатура;
	
	Если ОтборСобственныеАктивно Тогда
		Если ОтборСобственные Тогда
			ОбЗаголовок.Параметры.Собственный_Заказной = "Собственные (складские)";
		Иначе
			ОбЗаголовок.Параметры.Собственный_Заказной = "Заказные";
		КонецЕсли;
	Иначе
		ОбЗаголовок.Параметры.Собственный_Заказной = "Все";
	КонецЕсли;
	
	Результат.Вывести(ОбЗаголовок);
	Результат.Вывести(ОбШапка);
	
	Результат.НачатьАвтогруппировкуСтрок();

	ВыборкаПодразделение = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПодразделение.Следующий() Цикл
		
		ОбПодр.Параметры.Подразделение = ВыборкаПодразделение.Подразделение;
		Результат.Вывести(ОбПодр, 1, "Группа1");

		ВыборкаКанал = ВыборкаПодразделение.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаКанал.Следующий() Цикл

			Показатели = РассчитатьПоказатели2(ВыборкаКанал, Струк_ДанныеЗапросов.ТЗ);
			ОбКанал.Параметры.Заполнить(Показатели);
			НаименованиеКанал = ПолучитьПредставлениеКанал(ВыборкаКанал.КаналПродажи);
			ОбКанал.Параметры.Канал = НаименованиеКанал;
			
			Результат.Вывести(ОбКанал, 2, "Группа2");

			ТЗ_Сортировка = Новый ТаблицаЗначений;
			ТЗ_Сортировка.Колонки.Добавить("Номенклатура",		Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
			ТЗ_Сортировка.Колонки.Добавить("Выручка",			Новый ОписаниеТипов("Число")); 
			ТЗ_Сортировка.Колонки.Добавить("Стоимость",			Новый ОписаниеТипов("Число")); 
			ТЗ_Сортировка.Колонки.Добавить("Рентабельность",	Новый ОписаниеТипов("Число")); 
			ТЗ_Сортировка.Колонки.Добавить("ДатаРеализации",	Новый ОписаниеТипов("Дата")); 
			ТЗ_Сортировка.Колонки.Добавить("ДатаРасхода",		Новый ОписаниеТипов("Дата")); 
			
			ВыборкаНоменкл = ВыборкаКанал.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаНоменкл.Следующий() Цикл
                НоваяСтрока = ТЗ_Сортировка.Добавить();
				Показатели = РассчитатьПоказатели2(ВыборкаНоменкл, Струк_ДанныеЗапросов.ТЗ);
                ЗаполнитьЗначенияСвойств(НоваяСтрока, Показатели);
				НоваяСтрока.Номенклатура = ВыборкаНоменкл.Номенклатура;
			КонецЦикла;
			
			Если ВариантСортировки = "Номенклатура" Тогда
				ТЗ_Сортировка.Сортировать("Номенклатура");
			Иначе
				ТЗ_Сортировка.Сортировать("Рентабельность");
			КонецЕсли;			

			Для каждого СтрокаТЗ_Сортировка Из ТЗ_Сортировка Цикл
			
				ОбНоменкл.Параметры.Заполнить(СтрокаТЗ_Сортировка);
				Результат.Вывести(ОбНоменкл, 3, "Группа3", Ложь);

				СтруктураПоиска = Новый Структура("Номенклатура");
				СтруктураПоиска.Номенклатура = СтрокаТЗ_Сортировка.Номенклатура;
				ВыборкаНоменкл.Сбросить();
				Если ВыборкаНоменкл.НайтиСледующий(СтруктураПоиска) Тогда
				
					ВыборкаЗаказ = ВыборкаНоменкл.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаЗаказ.Следующий() Цикл

						Показатели = РассчитатьПоказатели2(ВыборкаЗаказ, Струк_ДанныеЗапросов.ТЗ);
						ОбЗаказ.Параметры.Заполнить(Показатели);
						ОбЗаказ.Параметры.Заказ = ВыборкаЗаказ.Заказ;
						ОбЗаказ.Параметры.РасшифровкаЗаказ = Новый Структура("Заказ", ВыборкаЗаказ.Заказ);
						Результат.Вывести(ОбЗаказ, 4, "Группа4", Ложь);
					
					КонецЦикла; // Заказ
					
				КонецЕсли;
			КонецЦикла; // Номенклатура
		КонецЦикла; // Канал
	КонецЦикла; // Подразделеиня

	Результат.ЗакончитьАвтогруппировкуСтрок();

	Показатели = РассчитатьПоказатели2(,Струк_ДанныеЗапросов.ТЗ);
	
	ОбИтого.Параметры.Заполнить(Показатели);
	
	Результат.Вывести(ОбИтого);
	
	Возврат "";
	
КонецФункции

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)

	Если Не ТипЗнч(Расшифровка) = Тип("Структура") Тогда
		Возврат;
	КонецЕсли;	
	
	СтандартнаяОбработка = Ложь;
	
	РасшифровкаЗаказ = Расшифровка.Заказ;
	
	ТабДок = СформироватьОтчетНаСервереЗаказыНоменклатура();
	
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.Показать();

КонецПроцедуры

#КонецОбласти

#Область Отчет_ЗаказыНоменклатура

Функция ПолучитьНомерЗаказаСРМ(п_Заказ)

	Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Номер заказа на сайте (Список заказов клиентов)");
	
	Рез = УправлениеСвойствами.ЗначениеСвойства(п_Заказ, Свойство);
	
	Возврат Рез;

КонецФункции // ()

Функция РассчитатьРентабельность(п_Секция, п_Выборка)
	
	Рез = Новый Структура("Прибыль,Рентабельность");
	
	Если п_Секция = "ШапкаТаблицы" Тогда
		Возврат Рез;
	КонецЕсли;
	
	Если (п_Выборка.Выручка = 0) И (п_Выборка.Стоимость = 0)Тогда
		Возврат Рез;
	КонецЕсли;

	Рез.Прибыль	= п_Выборка.Выручка - п_Выборка.Стоимость;

	Если п_Выборка.Выручка = 0 Тогда
		Возврат Рез
	КонецЕсли;
	
	Если п_Выборка.Стоимость > 0 Тогда
		Рез.Рентабельность = Рез.Прибыль / п_Выборка.Стоимость * 100;
	ИначеЕсли п_Выборка.Стоимость < 0 Тогда
		Рез.Рентабельность = - (Рез.Прибыль / п_Выборка.Стоимость * 100);
	КонецЕсли;

	Возврат Рез;

КонецФункции // ()

Процедура ПрисоединитьСекции(п_ТабДок, п_Макет, п_Секция, п_Показатели, п_Проценты = Неопределено);
	
	Если п_Проценты = Неопределено Тогда
		п_Проценты = Новый Структура;
	КонецЕсли;

	Об = п_Макет.ПолучитьОбласть(п_Секция + "|Стоимость");
	Об.Параметры.Заполнить(п_Показатели);
	Об.Параметры.Заполнить(п_Проценты);
	п_ТабДок.Присоединить(Об);

	Об = п_Макет.ПолучитьОбласть(п_Секция + "|Прибыль");
	Об.Параметры.Заполнить(п_Показатели);
	П = РассчитатьРентабельность(п_Секция, п_Показатели);
	Об.Параметры.Заполнить(П);
	п_ТабДок.Присоединить(Об);

	Об = п_Макет.ПолучитьОбласть(п_Секция + "|Рентабельность");
	Об.Параметры.Заполнить(п_Показатели);
	П = РассчитатьРентабельность(п_Секция, п_Показатели);
	Об.Параметры.Заполнить(П);
	п_ТабДок.Присоединить(Об);

КонецПроцедуры

Функция РассчитатьПоказатели(п_Выборка, п_ТЗ)
	
	Рез = Новый Структура("Стоимость, Прибыль, Рентабельность");

	Если НЕ ЗначениеЗаполнено(п_Выборка.Номенклатура) Тогда
		Возврат Рез;
	КонецЕсли;

	мСтоимость = п_ТЗ.НайтиСтроки(Новый Структура("Заказ, Номенклатура", п_Выборка.Заказ, п_Выборка.Номенклатура));
	
	Ит_Стоимость = 0;
	Ит_Сумма = 0;
	Если п_Выборка.Количество > 0 Тогда
		Для каждого Т Из мСтоимость Цикл
			Ит_Стоимость = Ит_Стоимость + Т.Стоимость;
		КонецЦикла;
		Рез.Стоимость	= Ит_Стоимость + Ит_Сумма;
		Рез.Прибыль	= п_Выборка.Выручка - (Ит_Стоимость + Ит_Сумма);
	Иначе		
		Для каждого Т Из мСтоимость Цикл
			Ит_Стоимость = Ит_Стоимость - Т.Стоимость;
		КонецЦикла;
		Рез.Стоимость	= - (Ит_Стоимость + Ит_Сумма);
		Рез.Прибыль	= п_Выборка.Выручка + (Ит_Стоимость + Ит_Сумма);
	КонецЕсли;
	
	Рез.Рентабельность = 0;
	Если Рез.Стоимость > 0 Тогда
		Рез.Рентабельность = Рез.Прибыль / Рез.Стоимость * 100;
	КонецЕсли;

	Возврат Рез;

КонецФункции // ()
 
Функция СформироватьОтчетНаСервереЗаказыНоменклатура()

	УстановитьПривилегированныйРежим(Истина);

	ТабДок = Новый ТабличныйДокумент;
	
	Об = РеквизитФормыВЗначение("Отчет");
	Макет = Об.ПолучитьМакет("МакетЗаказНоменклатура");

	Струк_ДанныеЗапросов = СобратьДанные("ЗаказыНоменклатура");
	РезультатЗапроса = Струк_ДанныеЗапросов.Запрос1;
	
	ОбЗаголовок			= Макет.ПолучитьОбласть("Заголовок|Начало");
	ОбШапкаНачало		= Макет.ПолучитьОбласть("ШапкаТаблицы|Начало");
	ОбПодрНачало		= Макет.ПолучитьОбласть("Подразделение|Начало");
	ОбКаналНачало		= Макет.ПолучитьОбласть("Канал|Начало");
	ОбЗаказНачало		= Макет.ПолучитьОбласть("Заказ|Начало");
	ОбНоменклНачало		= Макет.ПолучитьОбласть("Номенклатура|Начало");
	ОбИтогоНачало		= Макет.ПолучитьОбласть("ИТОГО|Начало");
	
	ТабДок.Очистить();
	ТабДокЗПпоМенеджерам.Очистить();
	
	ОбЗаголовок.Параметры.ПериодОтчета	= "с " + Формат(Отчет.ДатаНачала, "ДФ=dd.MM.yyyy")  + " по " + Формат(Отчет.ДатаОкончания, "ДФ=dd.MM.yyyy");
	ОбЗаголовок.Параметры.Подразделение	= Отчет.Подразделение;
	ОбЗаголовок.Параметры.КаналПродажи	= Отчет.КаналПродажи;
	
	Если ОтборСобственныеАктивно Тогда
		Если ОтборСобственные Тогда
			ОбЗаголовок.Параметры.Собственный_Заказной = "Собственные (складские)";
		Иначе
			ОбЗаголовок.Параметры.Собственный_Заказной = "Заказные";
		КонецЕсли;
	Иначе
		ОбЗаголовок.Параметры.Собственный_Заказной = "Все";
	КонецЕсли;

	ТабДок.Вывести(ОбЗаголовок);
	ТабДок.Вывести(ОбШапкаНачало);
	
	ПрисоединитьСекции(ТабДок, Макет, "ШапкаТаблицы", Новый Структура);
	
	ТабДок.НачатьАвтогруппировкуСтрок();

	ВыборкаИТОГО = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Рез = ВыборкаИТОГО.Следующий();
	Если НЕ Рез Тогда
		Возврат ТабДок;
	КонецЕсли;
	
	ЗП_ПоМенеджерам.Очистить();
	
	ВыборкаПодразделение	= ВыборкаИТОГО.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПодразделение.Следующий() Цикл
		
		ОбПодрНачало.Параметры.Заполнить(ВыборкаПодразделение);
		ТабДок.Вывести(ОбПодрНачало, 1, "Группа1");
		ПрисоединитьСекции(ТабДок, Макет, "Подразделение", ВыборкаПодразделение);

		ВыборкаКанал = ВыборкаПодразделение.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаКанал.Следующий() Цикл

			ОбКаналНачало.Параметры.Заполнить(ВыборкаКанал);
			НаименованиеКанал = ПолучитьПредставлениеКанал(ВыборкаКанал.КаналПродажи);
			ОбКаналНачало.Параметры.Канал = НаименованиеКанал;
			ТабДок.Вывести(ОбКаналНачало, 2, "Группа2");
			ПрисоединитьСекции(ТабДок, Макет, "Канал", ВыборкаКанал);

			ТЗ_Сортировка = Новый ТаблицаЗначений;
			ТЗ_Сортировка.Колонки.Добавить("Заказ",				Новый ОписаниеТипов("ДокументСсылка.ЗаказКлиента"));
			ТЗ_Сортировка.Колонки.Добавить("Выручка",			Новый ОписаниеТипов("Число")); 
			ТЗ_Сортировка.Колонки.Добавить("Стоимость",			Новый ОписаниеТипов("Число")); 
			ТЗ_Сортировка.Колонки.Добавить("Прибыль",			Новый ОписаниеТипов("Число")); 
			ТЗ_Сортировка.Колонки.Добавить("Рентабельность",	Новый ОписаниеТипов("Число")); 
			ТЗ_Сортировка.Колонки.Добавить("Проц",				Новый ОписаниеТипов("Число")); 
			ТЗ_Сортировка.Колонки.Добавить("НомерЗаказаСРМ",	Новый ОписаниеТипов("Строка")); 
			ТЗ_Сортировка.Колонки.Добавить("Источник",			Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(10)));
			ТЗ_Сортировка.Колонки.Добавить("ДатаРеализации",	Новый ОписаниеТипов("Дата")); 
			ТЗ_Сортировка.Колонки.Добавить("ДатаРасхода",		Новый ОписаниеТипов("Дата")); 

			ВыборкаЗаказ = ВыборкаКанал.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаЗаказ.Следующий() Цикл

				НоваяСтрока = ТЗ_Сортировка.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаЗаказ);

				Рез = РассчитатьРентабельность("Заказ", ВыборкаЗаказ);
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Рез);

				НоваяСтрока.НомерЗаказаСРМ = ПолучитьНомерЗаказаСРМ(ВыборкаЗаказ.Заказ);
			КонецЦикла;

			СтрЗП = ЗП_ПоМенеджерам.Добавить();
			СтрЗП.Подразделение						= ВыборкаПодразделение.Подразделение;
			СтрЗП.КодПлатежнойСистемы				= ВыборкаКанал.КодПлатежнойСистемы;
			СтрЗП.КодПлатежнойСистемыПредставление	= НаименованиеКанал;
			СтрЗП.Партнер							= ПолучитьПартнераКанал(ВыборкаКанал.КаналПродажи);
			СтрЗП.Прибыль							= ТЗ_Сортировка.Итог("Выручка") - ТЗ_Сортировка.Итог("Стоимость");
			
			Если ВариантСортировки = "ПоРентабельности" Тогда
				ТЗ_Сортировка.Сортировать("Рентабельность");
			Иначе
				ТЗ_Сортировка.Сортировать("НомерЗаказаСРМ");
			КонецЕсли;
			
			Для каждого СтрокаТЗ_Сортировка Из ТЗ_Сортировка Цикл
				
				ВыручкаЗаказа = СтрокаТЗ_Сортировка.Выручка;
				ОбЗаказНачало.Параметры.Заполнить(СтрокаТЗ_Сортировка);
				ТабДок.Вывести(ОбЗаказНачало, 3, "Группа3", Ложь);
				
				Если СтрокаТЗ_Сортировка.Заказ <> Неопределено Тогда
					СтруктураПоиска = Новый Структура("Заказ");
					СтруктураПоиска.Заказ = СтрокаТЗ_Сортировка.Заказ;
					ВыборкаЗаказ.Сбросить();
					Если ВыборкаЗаказ.НайтиСледующий(СтруктураПоиска) Тогда
						СуммаПроцентов = 0;
						СуммаПроцентов = 0;
						ВыборкаНоменклатура = ВыборкаЗаказ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						Пока ВыборкаНоменклатура.Следующий() Цикл
							Если ТипЗнч(ВыборкаНоменклатура.Номенклатура) = Тип("СправочникСсылка.Номенклатура")
								И ВыборкаНоменклатура.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Товар Тогда
									Продолжить;
							КонецЕсли;
							Если ВыручкаЗаказа <> 0 Тогда
								СуммаПроцентов = СуммаПроцентов + (ВыборкаНоменклатура.Стоимость / ВыручкаЗаказа * 100);
							КонецЕсли;
						КонецЦикла; // Номенклатура
						П = Новый Структура;
						П.Вставить("Проц",	СуммаПроцентов);
					КонецЕсли;
				КонецЕсли;
				
				ПрисоединитьСекции(ТабДок, Макет, "Заказ", СтрокаТЗ_Сортировка, П);

				Если СтрокаТЗ_Сортировка.Заказ <> Неопределено Тогда
					
					ВыборкаЗаказ.Сбросить();
					Если ВыборкаЗаказ.НайтиСледующий(СтруктураПоиска) Тогда

                        ВыборкаНоменклатура = ВыборкаЗаказ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						
						Пока ВыборкаНоменклатура.Следующий() Цикл
							ОбНоменклНачало.Параметры.Заполнить(ВыборкаНоменклатура);
							ОбНоменклНачало.Параметры.Источник			= СтрокаТЗ_Сортировка.Источник;
							ОбНоменклНачало.Параметры.НомерЗаказаСРМ	= СтрокаТЗ_Сортировка.НомерЗаказаСРМ;
							ТабДок.Вывести(ОбНоменклНачало, 4, "Группа4", Ложь);
							Если ВыручкаЗаказа <> 0 Тогда
								П = Новый Структура;
								П.Вставить("Проц",	ВыборкаНоменклатура.Стоимость / ВыручкаЗаказа * 100);
							КонецЕсли;
							ПрисоединитьСекции(ТабДок, Макет, "Номенклатура", ВыборкаНоменклатура, П);
						КонецЦикла; // Номенклатура
						
					КонецЕсли;
				КонецЕсли;
			КонецЦикла; // Заказы
		КонецЦикла; // Канал
		
	КонецЦикла; // Подразделеиня

	ТабДок.ЗакончитьАвтогруппировкуСтрок();

	ОбИтогоНачало.Параметры.Заполнить(ВыборкаИТОГО);
	
	ТабДок.Вывести(ОбИтогоНачало);
	ПрисоединитьСекции(ТабДок, Макет, "ИТОГО", ВыборкаИТОГО);

	Возврат ТабДок;
	
КонецФункции

#КонецОбласти

#Область Отчет_ЗарплатаПоМенеджерам

Функция ПолучитьКоэфЗП(п_Партнер)
	
	Запрос = Новый Запрос;
	Запрос_Текст = 
		"ВЫБРАТЬ
		|	Маркетплейсы_КоэффициентыЗПСрезПоследних.Коэффициент КАК Коэффициент,
		|	Маркетплейсы_КоэффициентыЗПСрезПоследних.Менеджер КАК Менеджер
		|ИЗ
		|	РегистрСведений.Маркетплейсы_КоэффициентыЗП.СрезПоследних(&ДатаСреза, Партнер = &Партнер) КАК Маркетплейсы_КоэффициентыЗПСрезПоследних
		|ГДЕ
		|	Маркетплейсы_КоэффициентыЗПСрезПоследних.Коэффициент > 0";
	
	Запрос.УстановитьПараметр("Партнер", п_Партнер);
	Запрос.УстановитьПараметр("ДатаСреза", КонецДня(Отчет.ДатаОкончания));
	
	Запрос.Текст = Запрос_Текст;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	М = Новый Массив();
	
	Пока Выборка.Следующий() Цикл
	    СтрукКоэф = Новый Структура("Менеджер,Коэффициент");
		ЗаполнитьЗначенияСвойств(СтрукКоэф, Выборка);
		М.Добавить(СтрукКоэф);
	КонецЦикла;
	
	Возврат М;

КонецФункции // ()

Функция ПолучитьПроцентЗП(пПодразделение)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КоэффициентыЗарплатыСрезПоследних.Процент КАК Процент
		|ИЗ
		|	РегистрСведений.КоэффициентыЗарплаты.СрезПоследних(&ДатаСреза, ) КАК КоэффициентыЗарплатыСрезПоследних
		|ГДЕ
		|	КоэффициентыЗарплатыСрезПоследних.Подразделение = &Подразделение";
	
	Запрос.УстановитьПараметр("Подразделение", пПодразделение);
	Запрос.УстановитьПараметр("ДатаСреза", КонецДня(ТекущаяДатаСеанса()));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Процент / 100;
	КонецЕсли;

	Запрос.УстановитьПараметр("Подразделение", Справочники.СтруктураПредприятия.ПустаяСсылка());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Процент / 100;
	КонецЕсли;
	
	Возврат 0;

КонецФункции

Процедура СформироватьОтчетЗарплатаПоМенеджерам()

	ЛогСообщить(" --- Отчет Зарплата по менеджерам --- ");
	ЛогСообщить("   -- Строк в таблице: " + ЗП_ПоМенеджерам.Количество());
	
	УстановитьПривилегированныйРежим(Истина);

	ТЗ = ЗП_ПоМенеджерам.Выгрузить(Новый Массив);
	
	Для каждого СтрТЗ_Канал Из ЗП_ПоМенеджерам Цикл

		ПроцентЗП = ПолучитьПроцентЗП(СтрТЗ_Канал.Подразделение);
		
		ЛогСообщить("Процент ЗП: " + ПроцентЗП + " " + СтрТЗ_Канал.Подразделение);
		
		ПрибыльКоэф = СтрТЗ_Канал.Прибыль * ПроцентЗП;

		ЛогСообщить("Прибыль Коэф: " + ПрибыльКоэф);
		
		МассивКоэф = ПолучитьКоэфЗП(СтрТЗ_Канал.Партнер);

		ЛогСообщить("  (1) Массив Коэф, количество: " + МассивКоэф.Количество());

		Если МассивКоэф.Количество() = 0 Тогда
			МассивКоэф = ПолучитьКоэфЗП(Справочники.Партнеры.ПустаяСсылка());
			ЛогСообщить("Массив Коэф получен по пустой ссылке Партнеры");
		КонецЕсли;

		ЛогСообщить("  (2) Массив Коэф, количество: " + МассивКоэф.Количество());

		Для каждого Т Из МассивКоэф Цикл
			НовааяСтрока = ТЗ.Добавить();
			НовааяСтрока.Менеджер							= Т.Менеджер;
			НовааяСтрока.Коэффициент						= Т.Коэффициент;
			НовааяСтрока.НачисленоЗарплата					= ПрибыльКоэф * Т.Коэффициент;
			НовааяСтрока.КодПлатежнойСистемы				= СтрТЗ_Канал.КодПлатежнойСистемы;
			НовааяСтрока.КодПлатежнойСистемыПредставление	= СтрТЗ_Канал.КодПлатежнойСистемыПредставление;
			НовааяСтрока.Прибыль							= СтрТЗ_Канал.Прибыль;
			НовааяСтрока.ПрибыльКоэф						= ПрибыльКоэф;
		КонецЦикла;
	КонецЦикла;
	
  	Об = РеквизитФормыВЗначение("Отчет");

    Схема = Об.ПолучитьМакет("СхемаКомпоновкиДанныхЗП");
	
    //Настройки = Отчет.КомпоновщикНастроек.ПолучитьНастройки();
    Настройки = Схема.НастройкиПоУмолчанию;

	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
    
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
    МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки, ДанныеРасшифровки);
	
	ВнешниеНаборыДанных = Новый Структура;
    ВнешниеНаборыДанных.Вставить("ТЗ", ТЗ);
    
    ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки, Истина);	
	
	ТабДокЗПпоМенеджерам.Очистить();
	
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
    ПроцессорВывода.УстановитьДокумент(ТабДокЗПпоМенеджерам);
    ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);	

	ДанныеРасшифровкиЗП = ПоместитьВоВременноеХранилище(ДанныеРасшифровки, ЭтаФорма.УникальныйИдентификатор);

КонецПроцедуры

#КонецОбласти 

#Область Настройки_ЗаполнитьСписокЗаказов

Процедура ЗаполнитьСписокЗаказовНаСервере()

	УстановитьПривилегированныйРежим(Истина);
	
	СКД = ПолучитьИзВременногоХранилища(АдресСхемы);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
    МакетКомпоновки = КомпоновщикМакета.Выполнить(СКД, ОтборЗаказы.Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));

	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
      
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
    ТЗ_Заказы = ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);

    Заказы.Очистить();
	Для каждого Т Из ТЗ_Заказы Цикл
		НоваяСтрока = Заказы.Добавить();
		НоваяСтрока.ЗаказКлиента = Т.ЗаказКлиента;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокЗаказов(Команда)
	ЗаполнитьСписокЗаказовНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СписокЗаказовОчистить(Команда)
	Заказы.Очистить();
КонецПроцедуры

#КонецОбласти

#Область Прочее

Процедура ПереключитьВидимостьСтраниц()
	Если ВариантОтчета = "Заказы_Номенклатура" Тогда
		Если РольДоступна("ПолныеПрава")
			ИЛИ QWERTY_Привилегированный.ПрофильДоступен(Справочники.ПрофилиГруппДоступа.Бухгалтер)
			Тогда
			Элементы.СтраницаЗарплатаПоМенеджерам.Видимость = Истина;
		КонецЕсли;
	ИначеЕсли ВариантОтчета = "Номенклатура_Заказы" Тогда
		Элементы.СтраницаЗарплатаПоМенеджерам.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

Процедура ЛогСообщить(ЗНАЧ М)
	
	ПолноеИмяФайла = "c:\log_1c\Валовая прибыль и доп расходы.txt";
	
	Попытка 
	    ЛогФайл = Новый ЗаписьТекста(ПолноеИмяФайла, КодировкаТекста.ANSI,,Истина,);
	    ЛогФайл.Записать(Формат(ТекущаяДата(),"ДЛФ=DT")+": " + М + Символы.ПС);
	    ЛогФайл.Закрыть();
	Исключение
	    Сообщить("ошибка записи лог файла");
	    Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры	

&НаКлиенте
Процедура ВыбратьПериодЗавершение(РезультатВыбора, ДопПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Отчет.ДатаНачала	= РезультатВыбора.НачалоПериода;
	Отчет.ДатаОкончания	= РезультатВыбора.КонецПериода;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(ЭтаФорма.Элементы.Результат, "НеАктуальность");

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериод(Команда)
	
	ПараметрыВыбора = Новый Структура("ДатаНачала,ДатаОкончания", Отчет.ДатаНачала, Отчет.ДатаОкончания);
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьПериодЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ВыборСтандартногоПериодаМесяц", ПараметрыВыбора, Элементы.ВыбратьПериод, , , , ОписаниеОповещения);
	
КонецПроцедуры

Функция ПолучитьПредставлениеКанал(п_Канал)

	Если ЗначениеЗаполнено(п_Канал) Тогда
		Возврат "" + п_Канал.ФИД + ", " + п_Канал;
	КонецЕсли;

КонецФункции

Функция ПолучитьПартнераКанал(п_Канал)

	УстановитьПривилегированныйРежим(Истина);

	Если ЗначениеЗаполнено(п_Канал) Тогда
		Возврат п_Канал.КлиентЗаказа;
	КонецЕсли;

КонецФункции

#КонецОбласти 
