Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("3.0.3.249");
	ПараметрыРегистрации.Информация = НСтр("ru = 'Валовая прибыль и доп. расходы, вер. 5.21, по каналам продаж'");
	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительныйОтчет();
	ПараметрыРегистрации.Версия = "5.21.0.0";
    ПараметрыРегистрации.БезопасныйРежим = ЛОЖЬ;
	
	Команда = ПараметрыРегистрации.Команды.Добавить();
	Команда.Представление = НСтр("ru = 'Валовая прибыль и доп. расходы, вер. 5.21 (по каналам продаж)'");
	Команда.Идентификатор = "ВаловаяПрибыльДопРасходы5";
	Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	Команда.ПоказыватьОповещение = Ложь;
	
	Возврат ПараметрыРегистрации;
	
КонецФункции


